i = 5# где 5-константа, а i-переменная
print(i)
i = i + 1
print(i)
s = '''Это многострочная строка. 
Это вторая её строчка. 
...их может быть много...'''
print(s)
'''
    Как это работает: Вот как эта программа работает. 
    Сперва мы присваиваем значение константы 5 переменной i, 
    используя оператор присваивания (=). Эта строка называется предложением и указывает, 
    что должно быть произведено некоторое действие, и в данном случае мы связываем имя переменной i 
    со значением 5. Затем мы печатаем значение i, используя функцию print, 
    которая просто печатает значение переменной на экране. Далее мыдобавляем к значению,
    хранящемуся в i и сохраняем его там.После этого мы печатаем его и получаем значение 6,
    что неудивительно. Аналогичным образом мы присваиваем строковую константу переменной s,
     после чего печатаем её.
'''
