'''Напишите программу, которая считывает со стандартного ввода целые числа,
по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.'''

s=int(input())
i=s

while s!=0:
    s=int(input())
    
    print(s)
    if s==0:
        print(s)
    x=s+i
    
print(s)